app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jack"], ["body", "Hello"], ["post_id", 1], ["created_at", "2015-06-03 16:35:02.521426"], ["updated_at", "2015-06-03 16:35:02.521426"]]