app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "Edit this post"], ["updated_at", "2015-06-03 15:59:24.372459"], ["id", 2]]